Repository: UngeheurenUngeziefer/JauhienLeaniuk
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: be, ru

source: Coding
be: Праграміраванне
ru: Программирование

source: My projects
be: Маі праекты
ru: Мои проекты

source: Jaŭhien Leaniuk
be: Яўген Леанюк
ru: Евгений Леонюк

source: Web development is something very popular in tech sphere, so I choose create this site portfolio using programs that I'm very familiar with such as
be: Вэб распрацоўка вельмі папулярная ў сферы IT апошні час, таму я вырашыў стварыць свой сайт партфоліо з выкарыстаннем праграм з якімі я найбольш добра знаёмы такіми як
ru: Веб разработка очень популярна в сфере IT последнее время, поэтому Я решил создать свой сайт портфолио с использованием программ с которыми я наиболее хорошо знаком такими как

source: (all images, backs, colors, icons, design),
be: (усе малюнкі, фоны, колеры, іконкі, дызайн)
ru: (все картинки, фоны, цвета, иконки, дизайн)

source: (to operate with Python and GitHub) and few technologies and frameworks:
be: (каб працаваць з Python і GitHub) і некаторыя тэхналогіі і фрэймворкі:
ru: (чтобы работать с Python и GitHub) и рядом технологий и фреймворков:

source: (web-framework, backend of this site),
be: (веб-фрэймворкі, бэкэнд сайта),
ru: (веб-фреймворк, бэкенд сайта),

source: (blocks and markup of the site),
be: (блёкі ды маркіроўка сайту),
ru: (блоки и разметка сайта),

source: (styles of html-blocks, effects of header),
be: (стылі html-блёкаў, эфекты шапкі),
ru: (стили блоков html, эффекты шапки сайта),

source: (map section selector),
be: (прагляд мапаў),
ru: (просмотр карт),

source: (language selector logic and so on),
be: (логіка выбару мовы і гэтак далей),
ru: (логика выбора языка и так далее),

source: (text translations logic and locale's auto selector),
be: (логіка перакладу тэксту і аўта выбар перакладу),
ru: (логика перевода текста и авто выбор перевода),

source: (all interactive SVG charts),
be: (усе інтэрактыўныя SVG графікі),
ru: (все интерактивные SVG графики),

source: (all calculations for charts),
be: (усе вылічэння для графікаў)
ru: (все вычисления для графиков)

source: (format of data from my running app).
be: (фармат інфармацыі з бегавой праграмы).
ru: (формат информации из бегового приложения).

source: I choose to read the book
be: Я выбраў прачытаць кнігу
ru: Я выбрал прочитать книгу

source: by Eric Matthes, so one of the proposed projects in this book is "Alien Invasion" project
be: Эрыка Мэтьюза, адным з прапанаваных праектаў у гэтай кнізе з'яўляецца гульня "Alien Invasion"
ru: Эрика Мэтьюза, одним из предложенных проектов в этой книге является игра "Alien Invasion"

source: , so there I'm finished it. With few self improvements like two guns instead of one and others.
be: , на гэтым этапе я яе завяршыў. З некалькімі фічамі як дзьве пушкі замест адной і іншымі.
ru: , на данном этапе я её завершил. С несколькими фичам вроде двух пистолетов вместо одного и другими.

source: This game is written very fast, but there is no some hard logic or many lines of code. The main goal to avoid bad drops and collect good. So this time I try to create more pure graphics and background changes every level.
be: Гэтая гульня напісана вельмі хутка, тут няма складанай логікі ці шмат строк кода. Галоўная мэта гульні пазбегнуць дрэнныя кроплі і збіраць добрыя. У гэты раз я паспрабаваў стварыць больш чыстую графіку, таксама дадана змяненне фону кожны узровень.
ru: Эта игра написана очень быстро, здесь нет сложной логики или много строк кода. Основная цель игры избегать плохие капли и собирать хорошие. В этот раз я попытался создать более чистую графику, также добавлено изменение фона каждый уровень.

source: One of my favorite games from NES is Road Fighter. So I choose to make my version of this game using
be: Адна з маіх любімых гульнь на NES гэта Road Fighter. Таму я выбраў стварыць сваю версію гэтай гульні з выкарыстоўваннем
ru: Одна из моих любимых игр на NES это Road Fighter. Поэтому я выбрал сделать свою версию этой игры с использованием

source: engine. I making this one little bit long, cause I'm carried away and create 3 lvl's, few final screens, few enemies and so on. But I think the project is great :)
be: двіжка. Я рабіў гэтую гульню некалькі доўга, таму што я пагрузіўся ў яе і зрабіў цэлых 3 узроўні, некалькі фінальных экранаў, некалькі ворагаў і гэтак далей. Думаю што праект круты :)
ru: движка. Я делал эту игру несколько долго, потому что я погрузился в неё и сделал целых 3 уровня, несколько финальных экранов, несколько врагов и так далее. Думаю что проект крутой :)

source: I think that except calculator, every programmer should know how to programm snake game. So I do the snake using
be: Я лічу што акрамя калькулятара, кожны праграміст павінен ведаць як зрабіць сваю змейку. Што ж я яе і зрабіў з дапамогай
ru: Я думаю что помимо калькулятора, каждый программист должен знать как сделать свою змейку. Что ж я её и сделал с помощью

source: Here I'm learn
be: Тут я вывучыў
ru: Тут я выучил

source: framework, which created to make games with pyxel-bit graphics. My first game used this engine is based on one of game examples in framework files, and the main goal of the game is to avoid the bullets and collect geometric shapes.
be: фрэймворк, які створаны каб рабіць гульні ў піксельнай графіцы. Мая першая гульня выкарыстоўваючая гэты двіжок заснавана на адной з гульнь прыкладаў у бібліятке , галоўная задача гульні пазбегнуць куль і збіраць сяброўскія постаці.
ru: фреймворк, который создан чтобы делать игры в пиксельной графике. Моя первая игра использующая этот движок основана на одной из игр примеров этой библиотеки , основной задачей игры является избегать пуль и собирать дружеские фигурки.

source: Some time later I write a
be: Некаторы час пазней я напісаў
ru: Некоторое время спустя я написал

source: test bot
be: тэст бота
ru: тест бота

source: who send a random article link on choosen language from another my project "The Dialogue".
be: які адпраўляе спасылку на выпадковы артыкул на выбранай мове з іншага майго праекта "Дыялог".
ru: который отправляет ссылку на случайную статью на выбранном языке из другого моего проекта "Диалог".

source: Telegram is growing fast last years, so I'm interested in creation Telegram bots on Python. First of all I make web-scraper for downloading images from site
be: Тэлеграм добра расце апошнія годы, таму я зацікавіўся стварэннем тэлеграм ботаў на Python. У пачатку я зрабіў парсер каб спампаваць відарысы з сайта
ru: Телеграм неплохо растёт последние года, поэтому я заинтересовался созданием телеграм ботов на Python. В начале я сделал парсер чтобы скачивать изображения с сайта

source: and then create bot who post images to the
be: далей стварыў бота які публікуе відарыс ў
ru: потом создал бота который постит изображения в

source: telegram channel
be: тэлеграм канал
ru: телеграм канал

source: as a administrator. You need to show bot link to the channel, give bot admin rights and send address of directory when images lay. So there I notice about telegram restriction for 3 sec time of posting, and make a correction.
be: як адміністратар. Вы павінны паказаць боту спасылку на канал, даць боту права адміністратара і адправіць адрэс дырэкторыі, дзе знаходзяцца малюнкі. Тут я даведаўся аб абмежаванні тэлеграма ў 3 секунды на посцінг і зрабіў адпаведнае выпраўленьне.
ru: как администратор. Вы должны показать боту ссылку на канал, дать боту права администратора и отправить адрес директории, где находятся картинки. Здесь я узнал о ограничении телеграма в 3 секунды на постинг и сделал соответствующее исправление.

source: My first project in Data Analytics. I analyse
be: Мой першы праект у Аналізе Дадзеных. Я прааналізаваў
ru: Мой первый проект в Анализе Данных. Я проанализировал

source: website and calculate many astronomic parameters and build graphics based on this calculations. Not all of my graphics look's very nice, but here I'm studied how to work with
be: сайт і вылічыў шмат астранамічных паказчыкаў і пабудаваў графікі заснаваные на гэтых вылічэннях. Не усе маі графікі выглядаюць добра, але тут Я пачаў працаваць з
ru: сайт и вычислил много астрономических показателей и построил графики основанные на этих вычислениях. Не все мои графики выглядят хорошо, но здесь Я научился работать с

source: and little bit of
be: і трошкі з
ru: и немного с

source: So there I first used classes and working with them.
be: Тут я ўпершыню выкарыстоўваў класы і стварыў праект з іх выкарыстаннем.
ru: Здесь я впервые использовал классы и создал проект с их использованием.

source: I read somewhere that every programmer should be able to write their own calculator, and I also wanted to try to make progress in creating a graphical interface, so the calculator via print in the console was a completed stage.
be: Я прачытаў недзе, што кожны праграміст павінен быць здольны напісаць свой асаблівы калькулятар, таму я вырашыў навучыцца ствараць графічны інтэрфейс, на гэтым этапе калькулятар праз кансоль быў ужо скончаным этапам.
ru: Я прочитал где то что каждый программист должен быть способен написать свой собственный калькулятор, поэтому я решил научиться создавать графический интерфейс, на данном этапе калькулятор через консоль был уже пройденным этапом.

source: This time I trying to create my first website with
be: На гэты раз я вырашыў стварцыь свой першы сайт з
ru: На этот раз я попытался создать мой первый сайт с

source: I made little sidebar with
be: я зрабіў невяліку бакавую панель з
ru: я сделал небольшую боковую панель с

source: and create two pages to show my skills.
be: і зрабіў две старонкі каб адлюстраваць сваі здольнасці.
ru: и создал две страницы чтобы показать свои способности.

source: My first interesting project finished after
be: Мой першы цікавы праект завершаны пасля праходжання курса
ru: Мой первый интересный проект завершённый после прохождения курса

source: Coursera Python Basics
be: Асновы праграмавання на Python
ru: Основы программирования на Python

source: course completed. Game based on simple if-else logic and working from console there is no GUI, but it's a first finished project writed fully by myself!
be: Гульня заснавана на простай if-else логіке і працуе з кансолі, тут няма графічнага інтэрфейсу, але гэта першы завершаны праект напісаны цалкам самастойна!
ru: Игра основана на простой if-else логике и работает из консоли, тут нет графического интерфейса, но это первый завершённый проект написанный полностью самостоятельно!

source: Little screensaver programm created with
be: Невялікая праграма скрынсэйвер створанная з
ru: Небольшая программа скринсейвер созданная с

source: Just some experiments with
be: Проста невялікія эксперымены з
ru: Просто небольшие эксперименты с

source: framework. There is few simple image movers by arrows and other controls.
be: Тут некалькі простых рухацелей малюнка з дапамогай стрэлак.
ru: Тут несколько простых двигателей картинки с помощью стрелок.

source: Contacts
be: Кантакты
ru: Контакты

source: Jaŭhien
be: Яўген
ru: Евгений

source: Leaniuk
be: Леанюк
ru: Леонюк

source: Teacher
be: Настаўнік
ru: Учитель

source: Entrepreneur
be: Фрылансер
ru: Фрилансер

source: Python Developer
be: Python распрацоўшчык
ru: Python разработчик

source: Author
be: Аўтар
ru: Автор

source: Janaŭ, Belarus
be: Янаў, Беларусь
ru: Янов, Беларусь

source: To contact me, you can write at any address shown on the right. I am always open to new projects and full-time work. Especially in Python development.
be: Каб звязацца са мной, Вы можаце напісаць на любы адрэс справа Я заўсёды адкрыты да новых праектаў а таксама любой працы. Асабліца ў сферы распрацоўкі на Python.
ru: Чтобы связаться со мной, Вы можете написать на любой адрес справа Я всегда открыт к новым проектам а также работе на полный день. Особенно в сфере разработки на Python.

source: Site created using this tech's and products:
be: Сайт зроблены з выкарыстаннем наступных тэхналогій і праграм:
ru: Сайт создан с использованием следующих технологий и программ:

source: some rights reserved.
be: некаторыя правы абаронены.
ru: некоторые права защищены.

source: Jaŭhien.Leaniuk
be: Яўген.Леанюк
ru: Евгений.Леонюк

source: Home
be: Хатняя
ru: Домашняя

source: Maps
be: Мапы
ru: Карты

source: Running
be: Бег
ru: Бег

source: Hi there! My name is Jaŭhien Leaniuk. I'm master of geography and junior python developer from Belarus. This is a portfolio-website created to show my skills, and also to present myself as a web-developer, and to show my own projects and hobbies. I have a passion in learning new programming technologies, geography, philosophy, running, self development and creation new things. I worked as a author, teacher (of geography), freelancer (mostly as a designer and animator) and analyst. As I develop my programming skills I will be sharing all my projects on this site (in coding section). Also this site will contain my other passions: maps that I've created as a geographer and
be: Прывітанне! Мяне зваць Леанюк Яўген. Я магістр геаграфіі і джуніор Python распрацоўшчык з Беларусі. Гэта сайт-партфоліо створаны каб адлюстраваць маі магчымасці, а таксама прэзентаваць сябе як вэб-распрацоўшчыка, таксама адлюстраваць маі праекты і захапленьні. Маі галоўныя захапленьні гэта вывучэнне новых тэналогій праграмавання, геаграфія, філясофія, бег, самаразвіццё і стварэнне новага ў любой форме. Я працаваў як аўтар, настаўнік (геаграфіі ), фрылансер (ў асноўным як дызайнер і мультыплікатар) і аналітык. З развіццём сваіх праграмісцкіх здольнасцей я буду дзяліцца сваімі праектамі на гэтым сайце (у секцыі праграмаванне). Таксама гэты сайт змяшчае некаторые мае іншыя захапленьні: мапы, якія я ствараў як географ і
ru: Привет! Меня зовут Леонюк Евгений. Я магистр географии и джуниор Python разработчик из Беларуси. Это сайт-портфолио созданный чтобы показать мои способности, а также представить себя как веб-разработчика, а также показать мои проекты и увлечения. Мои основные увлечения это изучение новых технологий программирования, география, философия, бег, саморазвитие и создание нового в любой форме. Я работал как автор, учитель (географии ), фрилансер (в основном как дизайнер и мультипликатор) и аналитик. По степени развития своих способностей как программиста я буду делиться своими проектами на этом сайте (в секции программирование). Также этот сайт содержит некоторые мои другие увлечения: карты, которые я создавал как географ и

source: author and my running statistic
be: аўтар і маю бегавую статыстыку
ru: автор и мою беговую статистику

source: Thanks for Your attention!
be: Дзякуй за ўвагу!
ru: Спасибо за внимание!

source: Tech's
be: Тэхналогіі
ru: Технологии

source: and
be: і
ru: и

source: Spheres
be: Сферы
ru: Сферы

source: used in my projects
be: выкарыстоўваючыяся ў маіх праектах
ru: использующиеся в моих проектах

source: September 2020
be: Верасень 2020
ru: Сентябрь 2020

source: My
be: Маі
ru: Мои

source: Skills
be: здольнасці
ru: Способности

source: My
be: Мой
ru: Мой

source: Expirience
be: Вопыт
ru: Опыт

source: Education of European leaders
be: Адукацыя Еўрапейскіх лідэраў
ru: Образование Европейских лидеров

source: European Countries and their National Animals
be: Еўрапейская краіны і іх нацыянальныя жывёлы
ru: Европейские страны и их национальные животные

source: How politics has an effect on the online encyclopedia that claims objectivity
be: Як палітыка ўплывае на энцыклапедыю якая прэтэндуе на аб'ектыўнасць
ru: Как политика влияет на энциклопедию которая претендует на объективность

source: The lithospheric plates of our planet
be: Літасферныя пліты нашай планеты
ru: Литосферные плиты нашей планеты

source: The movement speed of the tectonic plates of the Earth
be: Хуткасць руху тэктанічных пліт Зямлі
ru: Скорость движения тектонических плит Земли

source: Countries in war with ISIS
be: Краіны ў стане вайны з ІД
ru: Страны воюющие с ИГИЛ

source: Battles in 2016 aimed at fighting with ISIS
be: Баі ў 2016 супраць ІД
ru: Сражения в 2016 против ИГИЛ

source: Haplogroup by origin
be: Гаплагрупы і іх паходжанне
ru: Гаплогруппы и их происхождение

source: Civilizations by Huntington
be: Цывілізацыі па Хантынгтану
ru: Цивилизации по Хантингтону

source: Heraldry of German states
be: Геральдыка зямель Германіі
ru: Геральдика земель Германии

source: Flags of France
be: Сцягі Францыі
ru: Флаги Франции

source: Lion habitat
be: Арэал пражывання ільвоў
ru: Ареал обитания львов

source: Types of Flags of the World
be: Тыпы сцягаў Зямлі
ru: Типы флагов Земли

source: Human (7.4 billion, green) and cattle habitat (1.5 billion, lines)
be: Арэал пражывання: людзі (7.4 мілліярды, зялёным) і каровы (1.5 мілліярды, палоскі)
ru: Ареал обитания: люди (7.4 миллиарда, зелёным) и коровы (1.5 миллиардов, полоски)

source: This is how Columbia approximately looked like
be: Як прыкладна выглядае суперкантынент Калумбія
ru: Как примерно выглядел суперконтинент Колумбия

source: This is how Kenorland approximately looked like.
be: Як прыкладна выглядаў суперкантынент Кенорланд
ru: Как примерно выглядел суперконтинент Кенорланд

source: Rodinia as seen from the South Pole
be: Радынія з Паўднёвага Полюсу
ru: Родиния с Южного Полюса

source: Pannotia from the South Pole
be: Паннотыя з Паўднёвага Полюсу
ru: Паннотия с Южного Полюса

source: Pangaea
be: Пангея
ru: Пангея

source: North American Flags differentiation
be: Паўночна-Амерыканскія сцягі
ru: Северо-Американские флаги

source: South American Flags differentiation
be: Паўднёва-Амерыканскія сцягі
ru: Южно-Американские флаги

source: Oceanian Flags differentiation
be: Акіянскія сцягі
ru: Океанские флаги

source: Asian Flags differentiation
be: Азіятскія сцягі
ru: Азиатские флаги

source: African Flags differentiation
be: Афрыканскія сцягі
ru: Африканские флаги

source: Suicide rate
be: Узровень самазабойств
ru: Уровень самоубийств

source: European flags differentiation
be: Еўрапейскія сцягі
ru: Европейские флаги

source: My stats
be: Мая Статыстыка
ru: Моя Статистика

source: Start Time
be: Час пачатку
ru: Начало забега

source: My running statistic stored in adidas runtastic app. So I exported my data from 25 september 2019 to 25 september 2020 and make few visualisations of my stats using PyGal and Pandas. Start time of my trainings primary in evening zone, but there are some trainings in the morning because of my night work at the time.
be: Мая бегавая статыстыка захоўваецца ў прылажэнні адыдас runtastic. Таму я экспартаваў сваі дадзеныя з 25 верасня 2019 па 25 верасня 2020 і зрабіў некалькі візуалізацый маёй статыстыкі выкарыстоўваючы PyGal і Pandas. Пачатак забегаў пераважна ў вячэрняй зоне, але ёсць некалькі трэніровак ранкам зза начной працы ў гэты час.
ru: Моя беговая статистика хранится в приложении адидас runtastic. Поэтому я экспортировал свои данные с 25 сентября 2019 по 25 сентября 2020 и сделал несколько визуализаций моей статистики используя PyGal и Pandas. Начало забегов преемущественно в вечерней зоне, но есть несколько тренировок утром из за ночной работы в то время.

source: Distance
be: Дыстанцыя
ru: Дистанция

source: Here You may see the goal of 20km achieved. And the median distance about 5km.
be: Тут вы можаце пагледзець на дасягненнье дыстанцыі ў 20 км. І сярэднюю дыстанцыю каля 5км.
ru: Здесь вы можете увидеть достигнутую цель в 20 км. И среднюю дистанцию около 5км.

source: Speed
be: Хуткасць
ru: Скорость

source: At the average speed visualisation we may see the increase of speed by the time.
be: Візуалізацыя сярэдняй хуткасці. Тут можна убачыць невялікае павелічэнне сярэдняй хуткасьці з часам.
ru: Визуализация средней скорости. Здесь можно увидеть небольшое увеличение средней скорости со временем.

source: Here the same increasing of the maximum speed of trainigs.
be: Тут таксама павелічэнне максімальнай хуткасці.
ru: Здесь также увеличение максимальной скорости.

source: Duration
be: Хуткасць
ru: Длительность

source: Duration visualisation shown the median time about 15-25 minutes.
be: Працягласць адлюстроўвае сярэдні час у 15-25 хвілін.
ru: Длительность показывает среднее время в 15-25 минут.

source: Step Frequency
be: Частата крокаў
ru: Частота шагов

source: Step Frequency is important value in running, there are You may see the increase of the average step frequency.
be: Частата крокаў гэта вельмі важны паказнік у беге, тут таксама магчыма пагледзець павелічэнне сярэдняй частаты крокаў.
ru: Частота шагов это очень важный показатель в беге, здесь также можно увидеть увеличение средней частоты шагов.

source: Elevation
be: Набор вышыні
ru: Набор высоты

source: Visualisation show not high changes in elevations of runnings. All elevations is under 100 m.
be: Графік адлюстроўвае невялікія змены вышынь. Усе паказнікі ніжэй 100 метраў.
ru: График показывает небольшие изменения высот. Все показатели ниже 100 метров.

source: Total stats
be: Агульная статыстыка
ru: Общая статистика

source: There interesting total stats.
be: Яшчэ некалькі цікавых паказнікаў.
ru: Ещё несколько интересных показателей.
